app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sdfsdfsdf"], ["created_at", "2016-05-23 13:40:28.335040"], ["updated_at", "2016-05-23 13:40:28.335040"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save